of_cases/customMixerVessel.true/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

phases
(
     oil
     {
         nu         1e-06;
         kappa      1e-06;
         Cp         4195;
         rho        500;

         diameterModel constant;
         constantCoeffs
         {
             d               1e-3;
         }
     }

     air
     {
         nu         1.48e-05;
         kappa      2.63e-2;
         Cp         1007;
         rho        1;

         diameterModel constant;
         constantCoeffs
         {
             d              3e-3;
         }
     }
);

sigmas
(
    (air oil)       0.07
);

interfaceCompression
(
    (air oil)       0
);

virtualMass
(
    (air oil)       0.5
);

drag
(
    (air oil)
    {
        type blended;

        air
        {
            type SchillerNaumann;
            residualPhaseFraction 0;
            residualSlip 0;
        }

        oil
        {
            type SchillerNaumann;
            residualPhaseFraction 0;
            residualSlip 0;
        }

        residualPhaseFraction 1e-2;
        residualSlip 1e-2;
    }
);


// This is a dummy to support the Smagorinsky model
transportModel  Newtonian;
nu              0;


// ************************************************************************* //
